cases/advection/3Drotation/lent-hex-rotation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lentReconstruct;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6.28;

deltaT          0.01;

writeControl    timeStep;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep no;

maxAlphaCo 0.5;

maxDeltaT       1;

functions
{
    advectInterface 
    {
        type rotation;

        V (0 0 1); 
        axisPoint (0.5 0.5 0.5); 

        cellVelocityName U; 
        volFluxName phi; 
    }

}

libs ("libtwoPhaseValidation.so"); 

// ************************************************************************* //
